Repository: sasha01zuev/TextFromPictureBot
Catalog: locales/*/LC_MESSAGES/OCRbot.po
Languages: ru, uk

source: ✅ Canceled
ru: ✅ Отменено
uk: ✅ Скасовано

source: <b>To support us or get a paid subscription, you need to register in the official telegram crypto wallet bot - @CryptoBot and top up your wallet</b> ✅ If you chosen "<b>Support us</b>" — you can choose any amount to donate ✅ If you have chosen "<b>Paid subscription</b>" — you can choose several types of subscription: · <b>30$/month</b> — 3000 photos/hour, 125.000 photos/month, photo size limit - 5MB, more servers - less load · <b>60$/month</b> — 6000 photos/hour, 250.000 photos/month, photo size limit - 100MB, more servers - less load
ru: <b>Чтобы поддержать нас или оформить платную подписку, вам нужно зарегистрироваться в официальном крипто-кошельке от телеграм - @CryptoBot и пополнить ваш кошелёк</b> ✅ Если вы выбрали "<b>Поддержать нас</b>" — вы можете выбрать любую сумму для пожертвования ✅ Если вы выбрали "<b>Платная подписка</b>" — вы можете выбрать один из типов подписки: · <b>30$/месяц</b> — 3000 фото/час, 125.000 фото/месяц, максимальный размер фото - 5MB, больше серверов - меньше нагрузка · <b>60$/месяц</b> — 6000 фото/час, 250.000 фото/месяц, максимальный размер фото - 100MB, отдельный сервер - мгновенный ответ
uk: <b>Щоб підтримати нас або оформити платну підписку, вам потрібно зареєструватися в офіційному крипто-гаманці від телеграму - @CryptoBot і поповнити ваш гаманець</b> ✅ Якщо ви вибрали "<b>Підтримати нас</b>" — ви можете вибрати будь яку сумму для пожертвування ✅ Якщо ви вибрали "<b>Платна підписка</b>" — ви можете вибрати один ыз типыв пыдписки: · <b>30$/місяць</b> — 3000 зображень/годину, 125.000 зображень/месяц, максимальний размір зображення - 5MB, більше серверів - менше навантаження · <b>60$/місяць</b> — 6000 зображень/годину, 250.000 зображень/месяц, максимальний размір зображення - 100MB, окремий сервер - миттєва відповідь

source: <b>Choose your language:</b>
ru: <b>Выберите язык бота:</b>
uk: <b>Виберіть мову бота:</b>

source: ✅ Confirmed
ru: ✅ Подтверждено
uk: ✅ Підтверджено

source: ❗ Not confirmed
ru: ❗ Не подтверждено
uk: ❗ Не підтверджено

source: <b>CONTACTS: 👨‍💻 Chief Administrator: @Sasha_Zuev 💬 All updates and all news will be in our channel: {channel} 👥 Our chat: {chat}</b>
ru: <b>КОНТАКТЫ: 👨‍💻 Главный Администратор: @Sasha_Zuev 💬 Все обновления и все новости в нашем канале: {channel} 👥 Наш чат: {chat}</b>
uk: <b>Контакти: 👨‍💻 Головний Адміністратор: @Sasha_Zuev 💬 Всі оновлення та всі новини в нашому каналі: {channel} 👥 Наш чат: {chat}</b>

source: 🤫 <b>I work with <a href='https://bit.ly/38DrV5Y'>photos</a> or <a href='https://bit.ly/3rciXmB'>links</a> to the photo!</b>
ru: 🤫 <b>Я принимаю только <a href='https://bit.ly/3JqMPSx'>фото</a> или <a href='https://bit.ly/3vaoc7D'>URL</a> на фото!</b>
uk: 🤫 <b>Я приймаю тільки <a href='https://bit.ly/3EbVVSh'>зображення</a> або <a href='https://bit.ly/3DZSUUF'>URL</a> на зображення!</b>

source: <b>It's a bot for fetching text from photos.</b> 🔗 Send me link to photo which ends with .png .jpg .gif <b>For example:</b> <code>https://.../picture.png</code> 🖼 Send me photo. Only one photo - I can't fetch text from photo-albums yet 👆 Just tap on the text to copy it to clipboard 📋 If you have any questions or problems, then write to our chat - {chat} or our admins - /message_to_admin
ru: <b>Это бот для извлечения текста из фотографий.</b> 🔗 Пришлите мне URL ссылку на фото, которое заканчивается на .png .jpg .gif <b>Например:</b> <code>https://.../picture.png</code> 🖼 Пришлите мне фото. Только одно фото - не могу вытащить текст из фотоальбомов пока что 👆 Просто нажмите на текст, чтобы скопировать его в буфер обмена 📋 Если у вас есть вопросы или возникли проблемы, то пишите в наш чат - {chat} или нашим админам - /message_to_admin
uk: <b>Це бот для вилучення тексту із зображення.</b> 🔗 Відправте мені URL посилання, яке закінчується на .png .jpg .gif <b>Наприклад:</b> <code>https://.../picture.png</code> 🖼 Відправте мені зображення. Тільки одне зображення - не можу вилучити текст із альбому поки що 👆 Просто натисніть на текст, щоб скопіювати його в буфер обміну 📋 Якщо у вас є питання або виникли проблеми, то пишіть до нашого чату - {chat} або нашим адмінам - /message_to_admin

source: <b>Select message type:</b>
ru: <b>Выберите тип сообщения:</b>
uk: <b>Виберіть тип повідомлення:</b>

source: Hi, {first_name}😃 I can convert <u>photo to text</u>📝 Send me <b>photo</b> or <b>URL to photo</b> with text and I will try to make it right🗯
ru: Привет, {first_name}😃 Я могу извлечь <u>текст из фото</u>📝 Отправь мне <b>фото</b> или <b>URL ссылку на фото</b> с текстом и я попробую сделать это правильно🗯
uk: Привіт, {first_name}😃 Я можу вилучити <u>текст із зображення</u>📝 Відправ мені <b>зображення</b> або <b>URL посилання на зображення</b> із текстом і я спробую зробити це правильно🗯

source: You have already been registered!
ru: Вы уже зарегистрированы!
uk: Ви вже зареєстровані!

source: <b>Choose a plan:</b>
ru: <b>Выберите план подписки:</b>
uk: <b>Виберіть план підписки:</b>

source: <b>Choose a cryptocurrency:</b>
ru: <b>Выберите криптовалюту:</b>
uk: <b>Виберіть криптовалюту:</b>

source: Donation for the @{bot_username}
ru: Оплата для @{bot_username}
uk: Оплата для @{bot_username}

source: <b>Confirm payment or cancel action</b> <b>Amount</b>: ${amount} ({crypto_amount} {currency}) <b>Currency</b>: {currency}
ru: <b>Подтвердите оплату или отмените действие</b> <b>Сумма</b>: ${amount} ({crypto_amount} {currency}) <b>Валюта</b>: {currency}
uk: <b>Підтвердіть оплату або скасуйте дію</b> <b>Сума</b>: ${amount} ({crypto_amount} {currency}) <b>Валюта</b>: {currency}

source: Unknown error while generating invoice!
ru: Возникла неизвестная ошибка пока генерировал оплату!
uk: Виникла невідома помилка, поки генерував оплату!

source: <b>THANKS FOR DONATION!</b>
ru: <b>СПАСИБО ЗА ОПЛАТУ!</b>
uk: <b>ДЯКУЮ ЗА ОПЛАТУ!</b>

source: Not paid!
ru: Не оплачено!
uk: Не оплачено!

source: <b>Confirm your subscription plan or cancel the action:</b> <b>Currency:</b> {currency} <b>Amount:</b> ${amount}
ru: <b>Подтвердите план подписки или отмените действие:</b> <b>Валюта:</b> {currency} <b>Сумма:</b> ${amount}
uk: <b>Підтвердіть план підписки або скасуйте дію:</b> <b>Валюта:</b> {currency} <b>Сума:</b> ${amount}

source: <b>✅ {currency} currency selected 📈 1$ - {exchange_rate} {currency} ⬇ Write the donation amount in $0.5-500 below</b>
ru: <b>✅ {currency} - выбранная валюта 📈 1$ - {exchange_rate} {currency} ⬇ Напишите ниже сумму в пределах $0.5-5000</b>
uk: <b>✅ {currency} - вибрана валюта 📈 1$ - {exchange_rate} {currency} ⬇ Напишіть нижче суму в межах $0.5-5000</b>

source: ‼ <b>Enter an amount within $0.5-5000</b>
ru: ‼ <b>Впишите сумму в пределах $0.5-5000</b>
uk: ‼ <b>Впишіть суму в межах $0.5-5000</b>

source: <b>Confirm the payment amount or cancel the action:</b> <b>Currency:</b> {currency} <b>Amount:</b> ${amount}
ru: <b>Подтвердите сумму или отмените действие:</b> <b>Валюта:</b> {currency} <b>Сумма:</b> ${amount}
uk: <b>Підтвердіть суму або скасуйте дію:</b> <b>Валюта:</b> {currency} <b>Сума:</b> ${amount}

source: ‼ <b>Enter amount. For example: 1, 0.7, 55.4</b>
ru: ‼ <b>Введите число. Например: 1, 0.7, 55.4</b>
uk: ‼ <b>Введіть число. Наприклад: 1, 0.7, 55.4</b>

source: <b>Choose the language of the text on the photo:</b>
ru: <b>Выберите язык текста на фото:</b>
uk: <b>Виберіть мову тексту на зображенні:</b>

source: 😲 <b>Oops, some unknown error while getting the photo!</b>
ru: 😲 <b>Ууупс, вылезла какая-то неизвестная ошибка, пока получал фото!</b>
uk: 😲 <b>Ууупс, з'явилася якась невідома помилка поки отримував зображення!</b>

source: ❕<b>You have reached your daily limit (5 photos/day)! Subscription needed!</b> <b>More information here</b> → /donate
ru: ❕<b>Вы достигли суточного лимита (5 фото/день)! Нужно оформить подписку, чтобы использовать бота на всю мощность!</b> <b>Больше информации здесь</b> → /donate
uk: ❕<b>Ви досягли добового ліміту (5 зображень/день)! Потрібно оформити підписку, щоб використовувати бота на всю потужність!</b> <b>Більш інформації тут</b> → /donate

source: ⚠ <b>OCR is available only for those who are subscribed to our channel! Subscribe to <a href="https://t.me/VazonezBots">VAZONEZ BOTS</a>. Use the buttons below</b> ↡
ru: ⚠ <b>OCR доступен только для тех, кто подписан на наш канал! Подпишитесь на <a href="https://t.me/VazonezBots">VAZONEZ BOTS</a>. Используйте кнопки ниже</b> ↡
uk: ⚠ <b>OCR доступний лише для тих, хто підписаний на наш канал! Підпишіться на <a href="https://t.me/VazonezBots">VAZONEZ BOTS</a>. Використовуйте кнопки нижче</b> ↡

source: ⏳ Wait a bit...
ru: ⏳ Подождите немного...
uk: ⏳ Зачекайте трішки...

source: ❕<b>There is no text on the photo!</b>
ru: ❕<b>На фото нет текста!</b>
uk: ❕<b>На зображенні немає тексту!</b>

source: There is no text on the photo!
ru: ❕<b>На фото нет текста!</b>
uk: ❕<b>На зображенні немає тексту!</b>

source: ⚠ <b>Bot is overloaded now! Will be available within the hour Or sign up for a paid subscription - /donate</b>
ru: ⚠ <b>Бот сейчас перегружен! Будет доступен в течение часа или вы можете оформить платную подписку - /donate</b>
uk: ⚠ <b>Бот зараз перевантажений! Буде доступний протягом години або ви можете оформити платну підписку - /donate</b>

source: ⚠ <b>The photo size is too big! Try to reduce the size of the photo or send another photo! Or sign up for a paid subscription - /donate</b>
ru: ⚠ <b>Размер фото слишком большой! Попробуйте уменьшить размер фото или пришлите другое фото! Или вы можете оформить платную подписку - /donate</b>
uk: ⚠ <b>Розмір зображення занадто великий! Попробуйте зменшити розмір зображення або відправте інше зображення! Або ви можете оформити платну підписку - /donate</b>

source: ⚠ <b>Server overloaded, please try again later! Or sign up for a paid subscription - /donate</b>
ru: ⚠ <b>Сервер перегружен, попробуйте позже! Или оформите платную подписку - /donate</b>
uk: ⚠ <b>Сервер перевантажений, спробуйте пізніше! Або оформіть платну підписку - /donate</b>

source: ⚠ <b>An unexpected error has occurred</b>
ru: ⚠ <b>Произошла непредвиденная ошибка</b>
uk: ⚠ <b>Виникла непердбачувана помилка</b>

source: ❕ <b>There is no text on the photo!</b>
ru: ❕ <b>На фото нет текста!</b>
uk: ❕ <b>На зображенні немає тексту!</b>

source: 😲 <b>An unexpected error has occurred</b>
ru: 😲 <b>Произошла непредвиденная ошибка</b>
uk: 😲 <b>Виникла непердбачувана помилка</b>

source: ⚠ <b>Bot is overloaded now! Will be available within the hour! Or sign up for a paid subscription - /donate</b>
ru: ⚠ <b>Бот сейчас перегружен! Будет доступен в течение часа! Или вы можете оформить платную подписку - /donate</b>
uk: ⚠ <b>Бот зараз перевантажений! Буде доступний протягом часу! Або ви можете оформити платну підписку - /donate</b>

source: <b>Input message below ⬇</b>
ru: <b>Впишите сообщение ниже ⬇</b>
uk: <b>Впишіть повідомлення нижче ⬇</b>

source: ✅ <b>Message sent successfully! Expect a response soon!</b>
ru: ✅ <b>Сообщение успешно доставлено! Ожидайте ответа в ближайшее время!</b>
uk: ✅ <b>Повідомлення успішно доставлено! Очікуйте відповіді найближчим часом!</b>

source: ⬅ Cancel
ru: ⬅ Отменить
uk: ⬅ Скасувати

source: [1] Subscribe
ru: [1] Подписаться
uk: [1] Підписатися

source: [2] Check subscribe
ru: [2] Проверить подписку
uk: [2] Провірити підписку

source: 30$/month
ru: 30$/месяц
uk: 30$/місяць

source: 60$/month
ru: 60$/месяц
uk: 60$/місяць

source: ✅ Confirm
ru: ✅ Подтвердить
uk: ✅ Підтвердити

source: 🔗 Pay
ru: 🔗 Оплатить
uk: 🔗 Сплатити

source: ✅ Paid
ru: ✅ Оплатил
uk: ✅ Сплачено

source: Support us
ru: Поддержать нас
uk: Підтримати нас

source: Paid subscription
ru: Платная подписка
uk: Платна підписка

source: ❔ Question
ru: ❔ Вопрос
uk: ❔ Питання

source: 🧩 Recommendation/Suggestion
ru: 🧩 Рекомендация/Предложение
uk: 🧩 Рекомендація/Пропозиція

source: 📊 Bug report
ru: 📊 Отчёт об ошибке
uk: 📊 Звіт про помилку

source: 📜 Other
ru: 📜 Другое
uk: 📜 Інше

source: You have been banned! Contact @Sasha_Zuev
ru: Вы были забанены! Контакт @Sasha_Zuev
uk: Ви були забанені! Контакт @Sasha_Zuev

source: Press /start !
ru: Нажмите /start !

source: 🛑 So often!
ru: 🛑 Слишком часто!
uk: 🛑 Досить часто!

source: ⏳ Wait a few seconds!
ru: ⏳ Подождите несколько секунд!!
uk: ⏳ Зачекайте декілька секунд!

source: ⬅ Отменить
uk: ⬅ Скасувати
